---
title: ElementPhaseStatusFilter
classe: Autodesk.Revit.DB.ElementPhaseStatusFilter
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.ElementSlowFilter
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# ElementPhaseStatusFilter

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId PhaseId { get; }` | `elementPhaseStatusFilter.PhaseId` | ElementId |
| `ICollection<ElementOnPhaseStatus> GetPhaseStatuses()` | `elementPhaseStatusFilter.GetPhaseStatuses()` | ICollection<ElementOnPhaseStatus> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```